#+TITLE: Mark's Emacs Config
#+OPTIONS: toc:2 num:nil ^:nil

** Install ~diminish~

We also install ~diminish~, because ~use-package~ depends on it. ~diminish~ lets you hide minor modes from the mode-line.

#+BEGIN_SRC emacs-lisp

(unless (package-installed-p 'diminish)
  (package-install 'diminish))

(require 'diminish)

#+END_SRC

Now, we diminish some modes (I can't figure out where they are loaded):

#+BEGIN_SRC emacs-lisp
  (global-auto-revert-mode)
  (diminish 'auto-revert-mode)
#+END_SRC

#+RESULTS:
|   |
** Use org for the scratch buffer

#+BEGIN_SRC emacs-lisp
  (setq initial-major-mode 'org-mode)
  (setq initial-scratch-message "\
  # This buffer is for notes you don't want to save.")
#+END_SRC

#+RESULTS:
: # This buffer is for notes you don't want to save.

** Better defaults

#+BEGIN_SRC emacs-lisp 

  (use-package better-defaults
    :ensure t)

#+END_SRC

#+RESULTS:
|   |

** Make gpg-agent work

This function will load ~/.gpg-agent-info and source its contents into ~GPG_AGENT_INFO~.

I need this to pull mail for m4ue.

#+BEGIN_SRC emacs-lisp
  (defun my/gpg-agent ()
    "Load your gpg-agent.env file in to the environment

  This is extra useful if you use gpg-agent with --enable-ssh-support"
    (interactive)
    (let ((home (getenv "HOME"))
          (old-buffer (current-buffer)))
      (with-temp-buffer
        (insert-file-contents (concat home "/.gpg-agent-info"))
        (goto-char (point-min))
        (setq case-replace nil)
        (replace-regexp "\\(.*\\)=\\(.*\\)" "(setenv \"\\1\" \"\\2\")")
        (eval-buffer)))
    (message (getenv "GPG_AGENT_INFO")))

  (run-with-idle-timer 60 t 'my/gpg-agent)
  (my/gpg-agent)
#+END_SRC

#+RESULTS:
: /tmp/gpg-slIax0/S.gpg-agent:787:1
*** Putting it together
#+BEGIN_SRC emacs-lisp 

  (defun my/configure-org ()
    (setq org-image-actual-width 300)
    (setq org-src-fontify-natively t)
    (setq org-log-done 'time)

    (setq org-startup-truncated 'nil)
    (setq org-catch-invisible-edits 'smart)

    ;; Do not dim blocked tasks
    (setq org-agenda-dim-blocked-tasks nil)

    ;; Start up in org-indent-mode
    (setq org-startup-indented t)
    ;; Diminish org-indent-mode in the mode-line
    (eval-after-load 'org-indent '(diminish 'org-indent-mode))
    (setq org-hide-emphasis-markers t))


  (defun my/org-mode ()
    (my/org-mode-keyboard-shortcuts)
   ;; (my/org-variable-pitch)
    )

  (defun my/org-agenda-mode ()
    (my/org-agenda-keyboard-shortcuts))

  (setq-default fill-column 85)

#+END_SRC

#+RESULTS:
: 85

** Capture

#+BEGIN_SRC emacs-lisp
  (setq org-tag-alist '((:startgroup . nil)
                        ("OFFICE" . ?o)
                        ("HOME" . ?h)
                        ("ERRANDS" . ?e)
                        (:endgroup . nil)
                        ("COMPUTER" . ?c)
                        ("WATCH" . ?w)
                        ("READ" . ?r)
                        ("PHONE" . ?p)))

  (setq org-capture-templates
        '(("n" "Note" entry (file+headline "~/org/inbox.org" "Notes")
           "* %?\n:LOGBOOK:\n- Added %U\n:END:\n%a\n")
          ("p" "Project idea" entry (file+headline "~/org/inbox.org" "Project Ideas")
           "* %?\n:LOGBOOK:\n- Added %U\n:END:\n%a\n")
          ("c" "Calendar" entry (file+headline "~/org/calendar.org" "Calendar")
           "* %?\n")
          ("t" "Todo" entry (file+headline "~/org/inbox.org" "Tasks")
           "* TODO %?\nSCHEDULED: %(org-insert-time-stamp (org-read-date nil t \"+0d\"))\n:LOGBOOK:\n- Added %U\n:END:\n%a\n")))
#+END_SRC

#+RESULTS:
| n | Note | entry | (file+headline ~/org/inbox.org Notes) | * %? |

** PlantUML

#+BEGIN_SRC emacs-lisp
  (use-package plantuml-mode
    :ensure t
    :config
    (setq plantuml-jar-path (expand-file-name "~/src/plantuml.jar"))
    (setq org-plantuml-jar-path plantuml-jar-path)
    (add-to-list
     'org-src-lang-modes '("plantuml" . plantuml)))

  (add-hook 'org-babel-after-execute-hook
            (lambda ()
              (when org-inline-image-overlays
                (org-redisplay-inline-images))))
#+END_SRC

#+RESULTS:
| lambda | nil | (when org-inline-image-overlays (org-redisplay-inline-images)) |

